<div style="text-align:right;">Assignment 4 For Data Management and Database Design</div>
<div style="text-align:right">Zixiao Wang 001058840</div>

# Assignment 4

## README

To communicate with SQL Databases from within a JupyterLab notebook, I can use the SQL "magic" provided by the [ipython-sql](https://github.com/catherinedevlin/ipython-sql) extension. "Magic" is JupyterLab's term for special commands that start with "%". Below, I'll use the _load_\__ext_ magic to load the ipython-sql extension.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:fjwwzx970814@localhost/world

'Connected: root@world'

## Assignment Part 1

In [3]:
%sql SHOW databases;

 * mysql+pymysql://root:***@localhost/world
8 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('student_project',),
 ('sys',),
 ('test',),
 ('world',)]

In [4]:
%sql USE world;
%sql SHOW tables;

 * mysql+pymysql://root:***@localhost/world
0 rows affected.
 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

> I have import all world data

## Assignment Part 2

### 1. What is the World's Smallest surface area Nation?

How big is it?

In [5]:
%sql SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> Base the above, I will use SurfaceArea column.

In [6]:
%%sql 
SELECT Name, SurfaceArea 
FROM country 
WHERE SurfaceArea > 0 
ORDER BY SurfaceArea
LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Holy See (Vatican City State)', Decimal('0.40')),
 ('Monaco', Decimal('1.50')),
 ('Gibraltar', Decimal('6.00'))]

> The smallest furface area nation is Holy See (Vatican City State).  
Its surface ares is 0.4

## 2. What is the most populous Country in Africa?
* Show the SQL
* How big is it?

In [7]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> From above, I will use Region and Population.

In [8]:
%%sql
SELECT Region, COUNT(Region) 
FROM country 
WHERE Region LIKE '%Africa%'
GROUP BY Region;

 * mysql+pymysql://root:***@localhost/world
5 rows affected.

[('Central Africa', 9),
 ('Eastern Africa', 20),
 ('Western Africa', 17),
 ('Southern Africa', 5),
 ('Northern Africa', 7)]

> From above, it show all Africa country counts.

In [9]:
%%sql
SELECT Name, Region, Population
FROM country
WHERE Region LIKE '%Africa%'
ORDER BY Population DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Nigeria', 'Western Africa', 111506000),
 ('Egypt', 'Northern Africa', 68470000),
 ('Ethiopia', 'Eastern Africa', 62565000)]

> Nigeria has the most population in Africa, which is 111506000

## 3. What are the Poorest Countries in Asia?

* must have GNP data (GNP > 0)
* List 3 poorest nations.
* What is the GNP per person?

```
NOTE: GNP is measured in $1,000,000. So, Multiply your answer by 1,000,000 to get US$.
```

In [10]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> From above, I will use Region GNP

In [11]:
%%sql
SELECT Name, Region, GNP * 1000000 US$, GNP * 1000000/Population GNP_per_person
FROM country
WHERE Region LIKE '%Asia%' AND GNP > 0
ORDER BY GNP
LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Maldives', 'Southern and Central Asia', Decimal('199000000.00'), Decimal('695.804196')),
 ('Bhutan', 'Southern and Central Asia', Decimal('372000000.00'), Decimal('175.141243')),
 ('Mongolia', 'Eastern Asia', Decimal('1043000000.00'), Decimal('391.810669'))]

> From above, it shows the poorest nations and its per person GNP.

##  In what countries is ‘english’ and ‘hindi’ spoken?

In [12]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

In [13]:
%%sql
SELECT * FROM countrylanguage LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Dutch', 'T', Decimal('5.3')),
 ('ABW', 'English', 'F', Decimal('9.5')),
 ('ABW', 'Papiamento', 'F', Decimal('76.7'))]

> Base on these tables, I will use CountryCode and Code as join attribution.

In [14]:
%%sql
SELECT temp.Name FROM
(SELECT c.Name, COUNT(c.Name) num FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.Language = 'english' OR l.Language = 'hindi'
GROUP BY c.Name) AS temp
WHERE temp.num = 2

 * mysql+pymysql://root:***@localhost/world
1 rows affected.

[('Trinidad and Tobago',)]

## 5. How many people speak English?
2 queries: 
* how many in each country
* total for world

In [6]:
%%sql
SELECT c.Name, c.Population * l.Percentage Population_speak_English FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.Language = 'english' AND l.Percentage > 0;

 * mysql+pymysql://root:***@localhost/world
34 rows affected.

[('Aruba', Decimal('978500.0')),
 ('Netherlands Antilles', Decimal('1692600.0')),
 ('American Samoa', Decimal('210800.0')),
 ('Australia', Decimal('1533543200.0')),
 ('Belize', Decimal('12242800.0')),
 ('Bermuda', Decimal('6500000.0')),
 ('Brunei', Decimal('1016800.0')),
 ('Canada', Decimal('1881278800.0')),
 ('Denmark', Decimal('1599000.0')),
 ('United Kingdom', Decimal('5801356820.0')),
 ('Gibraltar', Decimal('2222500.0')),
 ('Guam', Decimal('6300000.0')),
 ('Hong Kong', Decimal('14920400.0')),
 ('Ireland', Decimal('371469840.0')),
 ('Japan', Decimal('12671400.0')),
 ('Saint Lucia', Decimal('3080000.0')),
 ('Macao', Decimal('236500.0')),
 ('Monaco', Decimal('221000.0')),
 ('Malta', Decimal('798420.0')),
 ('Northern Mariana Islands', Decimal('374400.0')),
 ('Malaysia', Decimal('35590400.0')),
 ('Norway', Decimal('2239250.0')),
 ('Nauru', Decimal('90000.0')),
 ('New Zealand', Decimal('335994000.0')),
 ('Palau', Decimal('60800.0')),
 ('Puerto Rico', Decimal('183390600.0')),
 ('Seychelles', Decimal('292600.0')),
 ('Trinidad and Tobago', Decimal('121082500.0')),
 ('United States', Decimal('23994373400.0')),
 ('Virgin Islands, U.S.', Decimal('7598100.0')),
 ('Vanuatu', Decimal('5377000.0')),
 ('Samoa', Decimal('108000.0')),
 ('South Africa', Decimal('343204500.0')),
 ('Zimbabwe', Decimal('25671800.0'))]

In [22]:
%%sql
SELECT sum(c.Population * l.Percentage) world_English_speaker
FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.language= "English"

 * mysql+pymysql://root:***@localhost/world
1 rows affected.

[(Decimal('34707786730.0'),)]